Repository: Ant-cpu/The-Chronicles-Of-Myrtana-Archolos.-Ukrainian-translation
Catalog: ArcholosOmegaT/tm/LOG_Constants_Talents.d_ru-RU_uk.tmx
Source language: ru_ru
Languages: uk

source: Прежде чем подойти к наковальне, мне стоит ознакомиться с чертежом оружия.
uk: Перш ніж підійти до ковадла, мені слід ознайомитися з кресленням зброї.

source: Когда я закончу с этим, мне нужно будет добыть материалы, необходимые для его изготовления, – это, конечно, железо и кожа, но для некоторых видов оружия понадобятся и другие материалы.
uk: Коли я закінчу з цим, мені потрібно буде отримати матеріали, необхідні для його виготовлення – це, звичайно, залізо та шкіра, але для деяких видів зброї знадобляться й інші матеріали.

source: Для создания действительно качественного оружия, мне нужно экспериментировать с разными материалами.
uk: Для створення справді якісної зброї мені потрібно експериментувати з різними матеріалами.

source: Однако нужно быть осторожным, чтобы не переусердствовать, лишние клыки и когти будут только мешать во время боя.
uk: Однак потрібно бути обережним, щоб не перестаратися, зайві ікла та пазурі будуть лише заважати під час бою.

source: На всякий случай лучше придерживаться инструкций в чертеже.
uk: Про всяк випадок краще дотримуватися інструкцій у кресленні.

source: На текущем уровне мастерства мне следует помнить, что любое несовершенство оружия может предопределить жизнь и смерть его владельца.
uk: На поточному рівні майстерності слід пам'ятати, що від будь-якої недосконалості зброї може залежати життя і смерть її власника.

source: Если у моего оружия будет какой-то дефект, я не смогу его использовать ни при каких условиях.
uk: Якщо моя зброя матиме дефект, я не зможу її використовувати ні за яких умов.

source: Похоже, мне предстоит провести немало часов у наковальни...
uk: Схоже, мені доведеться провести чимало годин біля ковадла...

source: Создавая стрелковое оружие, я должен помнить, что надо использовать только качественную древесину, то есть, прочную и гибкую.
uk: Створюючи стрілецьку зброю, я повинен пам'ятати, що треба використовувати тільки якісну деревину, тобто міцну та гнучку.

source: Лучше всего начать работу с прочтения нужного чертежа, их авторы имеют больше знаний в этой области, чем я, поэтому лучше следовать их инструкциям.
uk: Найкраще почати роботу з вивчення потрібного креслення, їх автори мають більше знань у цій галузі, ніж я, тому краще дотримуватись їхніх інструкцій.

source: Лучшее стрелковое оружие создается путем умелого сочетания материалов, полученных из животных и древесины.
uk: Найкраща стрілецька зброя створюється шляхом вмілого поєднання матеріалів, отриманих з тварин та деревини.

source: Чертежи дадут мне подсказки о том, с чем конкретно мне можно экспериментировать.
uk: Креслення дадуть мені підказки про те, з чим саме можна експериментувати.

source: Это было нелегко, но я каким-то образом достиг этого уровня.
uk: Це було нелегко, але я якимось чином досягнув цього рівня.

source: Теперь, чтобы создать стрелковое оружие, я могу читать чертежи мастеров, а отсюда, с практикой, прямая дорога к мастерству.
uk: Тепер, щоб створити стрілецьку зброю, я можу читати креслення майстрів, а це прямий шлях через практику до майстерності.
